#pragma once
#include "Mof.h"

namespace sip
{
	// ********************************************************************************
	/// <summary>
	/// Sip用フレームワークスレッド
	/// </summary>
	// ********************************************************************************
	class CSipFrameworkThread : public CThread
	{
	private:

		bool m_bEnd{ false }; //! 終了フラグ

	public:
		
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2021/02/03</created>
		/// <changed>いのうえ,2021/02/03</changed>
		// ********************************************************************************
		CSipFrameworkThread(void);
		
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2021/02/03</created>
		/// <changed>いのうえ,2021/02/03</changed>
		// ********************************************************************************
		virtual ~CSipFrameworkThread(void);

		// ********************************************************************************
		/// <summary>
		/// スレッドの実行関数
		/// </summary>
		/// <created>いのうえ,2021/02/03</created>
		/// <changed>いのうえ,2021/02/03</changed>
		// ********************************************************************************
		virtual void Run(void) override;

		// ********************************************************************************
		/// <summary>
		/// スレッド終了処理
		/// </summary>
		/// <created>いのうえ,2021/02/03</created>
		/// <changed>いのうえ,2021/02/03</changed>
		// ********************************************************************************
		void EndThread(void);
	};

    //! 名前の置き換え
	using LPSipFrameworkThread = CSipFrameworkThread*;
}