#pragma once
#include "Emitter.h"

namespace sip
{
	// ********************************************************************************
	/// <summary>
	/// エフェクトベースクラス
	/// </summary>
	// ********************************************************************************
	class CEffectBase
	{
	private:

		CEmitter<CMinMaxParameter>                 m_Emitter;        //! エミッター
		CEmitter<CMinMaxParameter>::CreateInfo     m_CreateInfo;     //! 生成情報
		std::list<CParticle::ParticlePtr>          m_ParticleList;   //! パーティクルリスト
		float                                      m_LifeTime;       //! 生存時間(秒)

	public:

		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		CEffectBase(void);

		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		~CEffectBase(void);

		// ********************************************************************************
		/// <summary>
		/// 読み込み
		/// </summary>
		/// <param name="pFileName">ファイル名</param>
		/// <returns>成功したかどうか</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		bool Load(LPCMofChar pFileName);

		// ********************************************************************************
		/// <summary>
		/// エミッターの再スタート
		/// </summary>
		/// <param name="pos">発生座標</param>
		/// <param name="t">寿命(単位は秒)</param>
		/// <returns>this</returns>
		/// <created>いのうえ,2020/08/07</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		CEffectBase& RestartEmitter(const Vector3& pos = Vector3(0, 0, 0), const float& t = 1.0f);

		// ********************************************************************************
		/// <summary>
		/// 初期化
		/// </summary>
		/// <param name="pos">発生座標</param>
		/// <param name="t">寿命(単位は秒)</param>
		/// <returns>this</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		CEffectBase& Initialize(const Vector3& pos = Vector3(0, 0, 0), const float& t = 1.0f);

		// ********************************************************************************
		/// <summary>
		/// 更新
		/// </summary>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		void Update(void);

		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		void Render(void) const;

		// ********************************************************************************
		/// <summary>
		/// 解放
		/// </summary>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		void Release(void);

		// ********************************************************************************
		/// <summary>
		/// 座標の設定
		/// </summary>
		/// <param name="pos">発生座標</param>
		/// <returns>this</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		CEffectBase& SetPos(const Vector3& pos);

		// ********************************************************************************
		/// <summary>
		/// 寿命の設定
		/// </summary>
		/// <param name="t">寿命(単位は秒)</param>
		/// <returns>this</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		CEffectBase& SetLifeTime(const float& t);

		// ********************************************************************************
		/// <summary>
		/// 寿命の取得
		/// </summary>
		/// <returns>寿命(単位は秒)</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		float GetLifeTime(void) const;

		// ********************************************************************************
		/// <summary>
		/// テクスチャの取得
		/// </summary>
		/// <returns>テクスチャのポインタ</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		std::shared_ptr<CTexture> GetTexture(void);

		// ********************************************************************************
		/// <summary>
		/// メッシュの取得
		/// </summary>
		/// <returns>メッシュのポインタ</returns>
		/// <created>いのうえ,2020/08/31</created>
		/// <changed>いのうえ,2020/08/31</changed>
		// ********************************************************************************
		std::shared_ptr<CMeshContainer> GetMesh(void);
	};
}