#pragma once
#include <chrono>

namespace sip
{
	// ********************************************************************************
	/// <summary>
	/// 時間を取得するスタティッククラス
	/// </summary>
	// ********************************************************************************
	class CMyTime
	{
	private:

		CMyTime(void) = delete;
		~CMyTime(void) = delete;

	public:

		// ********************************************************************************
		/// <summary>
		/// 起動時に呼び出しておく。プログラムが起動した時間の取得
		/// </summary>
		/// <returns>プログラムが起動した時間</returns>
		/// <created>いのうえ,2020/12/07</created>
		/// <changed>いのうえ,2020/12/07</changed>
		// ********************************************************************************
		static std::chrono::system_clock::duration InitTime(void);

		// ********************************************************************************
		/// <summary>
		/// 現在のシステム時間の取得
		/// </summary>
		/// <returns>現在のシステム時間</returns>
		/// <created>いのうえ,2020/12/07</created>
		/// <changed>いのうえ,2020/12/07</changed>
		// ********************************************************************************
		static std::chrono::system_clock::duration NowTime(void);

		// ********************************************************************************
		/// <summary>
		/// 起動してからの経過時間の取得(秒)
		/// </summary>
		/// <returns>起動してからの経過時間(秒)</returns>
		/// <created>いのうえ,2020/12/07</created>
		/// <changed>いのうえ,2020/12/07</changed>
		// ********************************************************************************
		static float Time(void);
	};
}

